---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceUtils
source: html/1d4d9853-ab61-8a7f-06eb-2c79032b47d3.htm
---
# Autodesk.Revit.DB.ExternalResourceUtils

A utility class containing functions related to external resource references.

## Syntax (C#)
```csharp
public static class ExternalResourceUtils
```

## Remarks
Elements which are external resource references refer to data outside of the base .rvt file.
 Examples include Revit links and the keynote table data.